(ns irclj.io-test
  (:use [irclj.io] :reload-all)
  (:use [clojure.test]))

(deftest byte-seq->str-test
  (letfn [(x [& a] (map byte a))]
    (is (= "hogehoge"
           (byte-seq->str (x 104 111 103 101 104 111 103 101))))
    ;; UTF-8
    (is (= "あいうえお"
           (byte-seq->str (x 227 129 130 227 129 132 227 129 134 227 129 136 227 129 138))))
    ;; JIS
    (is (= "あいうえお"
           (byte-seq->str (x 27 36 66 36 34 36 36 36 38 36 40 36 42 27 40 66))))
    ;; EUC
    ;; 短い文字列だと割とやばいけど、どうせIRCで使わないからいいよね
    (is (= "カリフォルニア投げは金持ちの道楽"
           (byte-seq->str (x 165 171 165 234 165 213 165 169 165 235 165 203 165 162 197 234 164 178 164 207 182 226 187 253 164 193 164 206 198 187 179 218))))
    ;; SJIS
    ;; これも短いと判別されにくいけど、どうせIRCで使わないからいいよね
    (is (= "いろはにほへとちりぬるを"
           (byte-seq->str (x 130 162 130 235 130 205 130 201 130 217 130 214 130 198 130 191 130 232 130 202 130 233 130 240))))))
